import { Todo } from '@/types/todo.type';

export const defaultTodos: Todo[] = [
	{
		title: 'Подготовить отчет по проекту',
		description:
			'Собрать все необходимые данные и оформить их в документе для презентации команде.',
		isCompleted: false,
	},
	{
		title: 'Организовать командную встречу',
		description:
			'Согласовать время и место, подготовить повестку дня для обсуждения текущих задач.',
		isCompleted: false,
	},
	{
		title: 'Убрать рабочее пространство',
		description:
			'Привести в порядок стол и организовать документы для повышения продуктивности.',
		isCompleted: false,
	},
	{
		title: 'Провести утреннюю зарядку',
		description:
			'Потратить 15-20 минут на физические упражнения для улучшения самочувствия и бодрости.',
		isCompleted: false,
	},
	{
		title: 'Составить список необходимых покупок',
		description:
			'Определить, какие продукты и вещи необходимо купить на этой неделе.',
		isCompleted: false,
	},
	{
		title: 'Изучить новую тему в области программирования',
		description:
			'Выделить время на изучение новой технологии или языка программирования, который вас интересует.',
		isCompleted: false,
	},
	{
		title: 'Провести анализ данных',
		description:
			'Посмотреть на собранные данные и выявить ключевые тенденции и паттерны.',
		isCompleted: false,
	},
	{
		title: 'Написать статью для блога',
		description:
			'Поделиться своими мыслями и опытом на тему, которая вам интересна.',
		isCompleted: false,
	},
	{
		title: 'Запланировать отпуск или выходные',
		description:
			'Выбрать направление и составить план поездки на выходные или отпуск.',
		isCompleted: false,
	},
	{
		title: 'Почитать интересную книгу',
		description:
			'Выбрать книгу, которая вас интересует, и выделить время для чтения.',
		isCompleted: false,
	},
	{
		title: 'Научиться готовить новое блюдо',
		description:
			'Выбрать рецепт и попробовать его приготовить, чтобы разнообразить своё меню.',
		isCompleted: false,
	},
	{
		title: 'Посетить выставку или музей',
		description:
			'Провести время, изучая искусство или историю, чтобы расширить свои горизонты.',
		isCompleted: false,
	},
];
